spec/fixtures/style_master_product_add_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <SOAP:Body>
    <StyleMasterProductAdd xmlns="http://rex11.com/webmethods/">
      <AuthenticationString>4vxVebc3D1zwsXjH9fkFpgpOhewauJbVu25WXjQ1gOo=</AuthenticationString>
      <products>
        <StyleMasterProduct>
          <Style xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_style</Style>
          <UPC xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_upc</UPC>
          <Size xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_size</Size>
          <Color xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_color</Color>
          <Description
              xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_description</Description>
          <Price xmlns="http://rex11.com/swpublicapi/StyleMasterProduct.xsd">the_price</Price>
        </StyleMasterProduct>
      </products>
    </StyleMasterProductAdd>
  </SOAP:Body>
</SOAP:Envelope>